app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "picture", "user_id", "created_at", "updated_at", "location") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)
    @task.user = current_user

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "status" = ?, "taken_by" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", true], ["taken_by", 2], ["updated_at", 2016-08-07 23:18:20 UTC], ["id", 1]]
---
  def update

    respond_to do |format|

      if @task.update(task_params)